function [x]=thomas_algorith(a,b,c,d)
%该函数根据thomas解线性方程组的解，这个方程组必须是三对角线性系统
%方程组的形式是,注意a,b,和r的位置
%[a1,b1,0,0..............0,0,0][x1]   =  [d1]
%[c1,a2,b2,0,0...........0,0,0][x2]   = [d2]
%[0,c2,a3,b3,0,..........0,0,0][x3]    =[d3]
%[0,.....................,,,,,][x.]    = [d.]
%[0,0,0,0,0,....cM-2,aM-1,bM-1][xM-1]  = [dM-1]
%[0,0,0,0,0,....0,0,0,cM-1,aM ][xM]    = [dM]
%其中a和d大小是M维的向量，b和c大小是M-1维的向量

%% LR分解，即LR=A
%L=[1  0  0  0  0 . . . 0]
%  [L1 1  0  0  0.......0]
%  [0  L2 0  0  0 ......0]
%  [0  0   LM-3  1   0  0]
%  [0  0        LM-2 1  0]
%  [0  0           LM-1 1]

%R=[m1  r1  0  0  0 ......0]
%  [0   m2  r2 0  0.......0]
%  [0   0   m3 r3 0.......0]
%  [0   0    mM-2  rM-2...0]
%  [0   0        mM-1  rM-1]
%  [0   0          0     mM]

[~,N]=size(a);%这里b是一个行向量
m=zeros(1,N);
L=zeros(1,N-1);

%% 计算r，可知r=b;
% r=b;

%% 计算m和L
m(1)=a(1);
for i=1:1:N-1
    L(i)=c(i)/m(i);
    m(i+1)=a(i+1)-L(i)*b(i);
end

%% LRx=d,有Ly=d,计算y
y=zeros(1,N);
y(1)=d(1);
for i=2:1:N
    y(i)=d(i)-L(i-1)*y(i-1);
end

%% Rx=y
x=zeros(1,N);
x(N)=y(N)/m(N);
for i=N-1:-1:1
    x(i)=(y(i)-b(i)*x(i+1))/m(i);
end

end















